//-----------------------------------------------------------------
// 程序描述:
// 　　DAC8563驱动程序
// 作　　者: 凌智电子
// 开始日期: 2020-09-29
// 完成日期: 2020-09-29
// 修改日期: 2020-09-29
// 当前版本: V1.0
// 历史版本:
// 　- V1.0: DAC8563驱动程序
// 调试工具: 凌智STM3核心开发板、1602液晶屏、LZE_ST_LINK2、DAC8563模块
// 说　　明: 
//				
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include "dac8563.h"
#include "spi.h"
#include "delay.h"

// 芯片手册显示存在：±1mV~±4mV的零码误差，模块本身8倍放大，误差为：±8mV~±32mV
// 零码误差测量，使ZeroCode_Error = 0，模块输出0V，如果测量为-5mV，即将ZeroCode_Error幅值为5
int16_t ZeroCode_Error = -32;	

//-----------------------------------------------------------------
// void DAC8563_GPIO_Init(void)
//-----------------------------------------------------------------
//
// 函数功能: DAC8563引脚初始化
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无

//-----------------------------------------------------------------
void DAC8563_GPIO_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);		// 开启GPIOB时钟

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;				// 设置为上拉输入
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;				// 时钟50MHz
	GPIO_Init(GPIOB,&GPIO_InitStructure);										// 初始化
	DAC8563_SYNC_H;
	SPI2_Init();
	
	// DAC-A和DAC-B上电
	DAC8563_Write_Reg(0x20, 0x0003);
	// LDAC引脚不使用
	DAC8563_Write_Reg(0x30, 0x0003);
	// DAC通道增益为2
  DAC8563_Write_Reg(0x38, 0x0001);
}

//-----------------------------------------------------------------
// void DAC8563_Write_Reg(u16 data)
//-----------------------------------------------------------------
//
// 函数功能: DAC8563写数据
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无

//-----------------------------------------------------------------
void DAC8563_Write_Reg(u8 cmd, u16 data)
{
	DAC8563_SYNC_L;
	SPI2_ReadWriteByte(cmd);
	SPI2_ReadWriteByte((data >> 8) & 0x00FF);
	SPI2_ReadWriteByte(data & 0x00FF);
	DAC8563_SYNC_H;
}

//-----------------------------------------------------------------
// void DAC8563_Write_CHA(uint16_t data)
//-----------------------------------------------------------------
//
// 函数功能: DAC8563通道A数据更新
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
//
//-----------------------------------------------------------------
void DAC8563_Write_CHA(uint16_t data)
{
	DAC8563_Write_Reg(0x18, data);
}

//-----------------------------------------------------------------
// void DAC8563_Write_CHB(uint16_t data)
//-----------------------------------------------------------------
//
// 函数功能: DAC8563通道B数据更新
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
//
//-----------------------------------------------------------------
void DAC8563_Write_CHB(uint16_t data)
{
	DAC8563_Write_Reg(0x19, data);
}

//-----------------------------------------------------------------
// void DAC8563_Write_CHA_CHB(uint16_t data)
//-----------------------------------------------------------------
//
// 函数功能: DAC8563通道A通道B数据更新
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
//
//-----------------------------------------------------------------
void DAC8563_Write_CHA_CHB(uint16_t data)
{
	DAC8563_Write_Reg(0x1F, data);
}

//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
