//-----------------------------------------------------------------
// 程序描述:
//     DAC8563驱动程序
// 作    者: 凌智电子
// 开始日期: 2020-11-11
// 完成日期: 2020-11-11
// 修改日期: 
// 当前版本: V1.0
// 历史版本:
//  - V1.0:  DAC8563驱动程序
// 调试工具: 凌智STM32H750核心板、LZE_ST_LINK2
// 说    明: 
//    
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include "dac8563.h"
#include "delay.h"

//-----------------------------------------------------------------
// void DAC8563_Init(void)
//-----------------------------------------------------------------
//
// 函数功能: DAC8563初始化
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无

//-----------------------------------------------------------------
void DAC8563_Init(void)
{
  GPIO_InitTypeDef  GPIO_InitStruct;
  __HAL_RCC_GPIOB_CLK_ENABLE();												// 开启GPIOC时钟

	// SYNC->PB12  SCLK->PB13  DIN->PB15
  GPIO_InitStruct.Pin = GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_15;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;					// 推挽输出
  GPIO_InitStruct.Pull = GPIO_PULLUP;									// 上拉
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;	// 高速
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);							// 初始化

	// DAC-A和DAC-B上电
	DAC8563_Write_Reg((4 << 19) | (0 << 16) | (3 << 0));
	// LDAC引脚不使用
	DAC8563_Write_Reg((6 << 19) | (0 << 16) | (3 << 0));
	// DAC通道增益为2
  DAC8563_Write_Reg((7 << 19) | (0 << 16) | (1 << 0));
}

//-----------------------------------------------------------------
// void SPI_Send_Data(uint32_t dat)
//-----------------------------------------------------------------
// 
// 函数功能: SPI发送1个字节数据
// 入口参数: u8 dat： 待发送的数据
// 返 回 值: 无
// 注意事项: 无
//
//-----------------------------------------------------------------
void SPI_Send_Data(uint32_t dat)
{
	u8 i;
	
	DAC8563_SYNC_L;
	for(i=0;i<24;i++)
	{
		DAC8563_SCLK_H;
		if(dat&0x800000)
			DAC8563_DIN_H;
		else
			DAC8563_DIN_L;
		DAC8563_SCLK_L;
		dat<<=1;
	}
	DAC8563_SYNC_H;
}

//-----------------------------------------------------------------
// void DAC8563_Write_Reg(uint32_t data)
//-----------------------------------------------------------------
//
// 函数功能: DAC8563写数据
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无

//-----------------------------------------------------------------
void DAC8563_Write_Reg(uint32_t data)
{
	SPI_Send_Data(data);
}

//-----------------------------------------------------------------
// void DAC8563_Write_CHA(uint16_t data)
//-----------------------------------------------------------------
//
// 函数功能: DAC8563通道A数据更新
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
//
//-----------------------------------------------------------------
void DAC8563_Write_CHA(uint16_t data)
{
  DAC8563_Write_Reg(0x180000|data);
}

//-----------------------------------------------------------------
// void DAC8563_Write_CHB(uint16_t data)
//-----------------------------------------------------------------
//
// 函数功能: DAC8563通道B数据更新
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
//
//-----------------------------------------------------------------
void DAC8563_Write_CHB(uint16_t data)
{
	DAC8563_Write_Reg(0x190000|data);
}

//-----------------------------------------------------------------
// void DAC8563_Write_CHA_CHB(uint16_t data)
//-----------------------------------------------------------------
//
// 函数功能: DAC8563通道A通道B数据更新
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
//
//-----------------------------------------------------------------
void DAC8563_Write_CHA_CHB(uint16_t data)
{
	DAC8563_Write_Reg(0x1F0000|data);
}

//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
