//-----------------------------------------------------------------
// 程序描述:
//     DAC8563驱动程序
// 作    者: 凌智电子
// 开始日期: 2022-06-27
// 完成日期: 2022-06-27
// 修改日期: 
// 当前版本: V1.0
// 历史版本:
//  - V1.0:  DAC8563驱动程序
// 调试工具: 凌智STM32F429+CycloneIV电子系统设计开发板、LZE_ST_LINK2、DAC8563模块
// 说    明: 
//    
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include "dac8563.h"
#include "spi.h"
#include "delay.h"

SPI_HandleTypeDef SPI2_Handler;  	// SPI句柄

// 芯片手册显示存在：±1mV~±4mV的零码误差，增益8倍放大，误差为：±8mV~±32mV
// 零码误差测量，使ZeroCode_Error = 0，模块输出0V，如果测量为-5mV，即将ZeroCode_Error幅值为5
int16_t ZeroCode_Error = -36;	

//-----------------------------------------------------------------
// void DAC8563_Init(void)
//-----------------------------------------------------------------
//
// 函数功能: DAC8563初始化
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无

//-----------------------------------------------------------------
void DAC8563_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	__HAL_RCC_GPIOC_CLK_ENABLE();
	
	GPIO_InitStructure.Pin = GPIO_PIN_4;
	GPIO_InitStructure.Speed = GPIO_SPEED_LOW;
	GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStructure.Pull = GPIO_PULLUP;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);
	
	SPI5_Init();
	
	// DAC-A和DAC-B上电
	DAC8563_Write_Reg(0x20, 0x0003);
	// LDAC引脚不使用
	DAC8563_Write_Reg(0x30, 0x0003);
	// DAC通道增益为2
  DAC8563_Write_Reg(0x38, 0x0001);
}

//-----------------------------------------------------------------
// void DAC8563_Write_Reg(uint16_t data)
//-----------------------------------------------------------------
//
// 函数功能: DAC8563写数据
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无

//-----------------------------------------------------------------
void DAC8563_Write_Reg(uint8_t cmd, uint16_t data)
{
	DAC8563_SYNC_L;
	SPI5_Send_Byte(cmd);
	SPI5_Send_Byte((data >> 8) & 0x00FF);
	SPI5_Send_Byte( data & 0x00FF );
	DAC8563_SYNC_H;
}

//-----------------------------------------------------------------
// void DAC8563_Write_CHA(uint16_t data)
//-----------------------------------------------------------------
//
// 函数功能: DAC8563通道A数据更新
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
//
//-----------------------------------------------------------------
void DAC8563_Write_CHA(uint16_t data)
{
	DAC8563_Write_Reg(0x18, data);
}

//-----------------------------------------------------------------
// void DAC8563_Write_CHB(uint16_t data)
//-----------------------------------------------------------------
//
// 函数功能: DAC8563通道B数据更新
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
//
//-----------------------------------------------------------------
void DAC8563_Write_CHB(uint16_t data)
{
	DAC8563_Write_Reg(0x19, data);
}

//-----------------------------------------------------------------
// void DAC8563_Write_CHA_CHB(uint16_t data)
//-----------------------------------------------------------------
//
// 函数功能: DAC8563通道A通道B数据更新
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
//
//-----------------------------------------------------------------
void DAC8563_Write_CHA_CHB(uint16_t data)
{
	DAC8563_Write_Reg(0x1F, data);
}

//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
